In [3]:
import numpy as np
import pandas as pd

90

hanaf        NaN
haroon       NaN
hassnat    180.0
uzma       184.0
dtype: float64

1    a
2    b
3    c
4    d
5    e
dtype: object

0    10
1    20
2    30
3    40
4    50
dtype: int64

A    100
B    200
C    300
dtype: int64

'e'

In [30]:
ser2['cookie']

20

In [31]:
ser3 =pd.Series([5,10,15,20], ['uzz','hass','rani', 'bambi'])

In [32]:
ser3

uzz       5
hass     10
rani     15
bambi    20
dtype: int64

In [33]:
ser2 + ser3

bambi      NaN
cookie     NaN
hass      20.0
naz        NaN
rani       NaN
uzz       10.0
dtype: float64

In [16]:
# data frames

In [34]:
from numpy.random import randn
np.random.seed(101)

In [110]:
df = pd.DataFrame(randn(4,4),index= 'u x m i'.split(), columns= 'n a z o'.split())
df

          n         a         z         o
u -0.497104 -0.754070 -0.943406  0.484752
x -0.116773  1.901755  0.238127  1.996652
m -0.993263  0.196800 -1.136645  0.000366
i  1.025984 -0.156598 -0.031579  0.649826

In [111]:
df.loc['m']

n   -0.993263
a    0.196800
z   -1.136645
o    0.000366
Name: m, dtype: float64

In [112]:
df['mini'] = df['z']
df

          n         a         z         o      mini
u -0.497104 -0.754070 -0.943406  0.484752 -0.943406
x -0.116773  1.901755  0.238127  1.996652  0.238127
m -0.993263  0.196800 -1.136645  0.000366 -1.136645
i  1.025984 -0.156598 -0.031579  0.649826 -0.031579

In [113]:
 np.arange(6,10).reshape(4,1)

array([[6],
       [7],
       [8],
       [9]])

In [114]:
df.shape

(4, 5)

In [115]:
df.drop('mini', axis=1)

          n         a         z         o
u -0.497104 -0.754070 -0.943406  0.484752
x -0.116773  1.901755  0.238127  1.996652
m -0.993263  0.196800 -1.136645  0.000366
i  1.025984 -0.156598 -0.031579  0.649826

In [116]:
df.loc['m']

n      -0.993263
a       0.196800
z      -1.136645
o       0.000366
mini   -1.136645
Name: m, dtype: float64

In [117]:
df.iloc[1]

n      -0.116773
a       1.901755
z       0.238127
o       1.996652
mini    0.238127
Name: x, dtype: float64

In [118]:
df.loc['u','z']

-0.9434064032519315

In [119]:
df.loc[['u','x'],['a','o']]

          a         o
u -0.754070  0.484752
x  1.901755  1.996652

In [120]:
df

          n         a         z         o      mini
u -0.497104 -0.754070 -0.943406  0.484752 -0.943406
x -0.116773  1.901755  0.238127  1.996652  0.238127
m -0.993263  0.196800 -1.136645  0.000366 -1.136645
i  1.025984 -0.156598 -0.031579  0.649826 -0.031579

In [121]:
df<0

       n      a      z      o   mini
u   True   True   True  False   True
x   True  False  False  False  False
m   True  False   True  False   True
i  False   True   True  False   True

In [122]:
df[df>0]

          n         a         z         o      mini
u       NaN       NaN       NaN  0.484752       NaN
x       NaN  1.901755  0.238127  1.996652  0.238127
m       NaN  0.196800       NaN  0.000366       NaN
i  1.025984       NaN       NaN  0.649826       NaN

In [123]:
df[df['o']>0]

          n         a         z         o      mini
u -0.497104 -0.754070 -0.943406  0.484752 -0.943406
x -0.116773  1.901755  0.238127  1.996652  0.238127
m -0.993263  0.196800 -1.136645  0.000366 -1.136645
i  1.025984 -0.156598 -0.031579  0.649826 -0.031579

In [124]:
df

          n         a         z         o      mini
u -0.497104 -0.754070 -0.943406  0.484752 -0.943406
x -0.116773  1.901755  0.238127  1.996652  0.238127
m -0.993263  0.196800 -1.136645  0.000366 -1.136645
i  1.025984 -0.156598 -0.031579  0.649826 -0.031579

In [125]:
df.drop('mini', axis=1, inplace= True)

In [126]:
df

          n         a         z         o
u -0.497104 -0.754070 -0.943406  0.484752
x -0.116773  1.901755  0.238127  1.996652
m -0.993263  0.196800 -1.136645  0.000366
i  1.025984 -0.156598 -0.031579  0.649826

In [127]:
#returns column z less than zero

In [128]:
df[df['z']<0]

          n         a         z         o
u -0.497104 -0.754070 -0.943406  0.484752
m -0.993263  0.196800 -1.136645  0.000366
i  1.025984 -0.156598 -0.031579  0.649826

In [132]:
df[df['a']>0]  # gives all the rows of a >0

          n         a         z         o
x -0.116773  1.901755  0.238127  1.996652
m -0.993263  0.196800 -1.136645  0.000366

In [141]:
df[df['n']>0][['a','z']]  #gives only true values in col a and z

          a         z
i -0.156598 -0.031579

In [142]:
df[df['a']>0][['a','z','o']]

          a         z         o
x  1.901755  0.238127  1.996652
m  0.196800 -1.136645  0.000366

In [149]:
df[(df['n']>0) | (df['o']>0)]  #given or condition

          n         a         z         o
u -0.497104 -0.754070 -0.943406  0.484752
x -0.116773  1.901755  0.238127  1.996652
m -0.993263  0.196800 -1.136645  0.000366
i  1.025984 -0.156598 -0.031579  0.649826

In [150]:
df[(df['n']>0) &(df['o']>0)]  #given and condition

          n         a         z         o
i  1.025984 -0.156598 -0.031579  0.649826

In [152]:
df.reset_index()

  index         n         a         z         o
0     u -0.497104 -0.754070 -0.943406  0.484752
1     x -0.116773  1.901755  0.238127  1.996652
2     m -0.993263  0.196800 -1.136645  0.000366
3     i  1.025984 -0.156598 -0.031579  0.649826

In [157]:
stadt = 'Berlin Stuttgart München Köln'.split()
stadt

['Berlin', 'Stuttgart', 'München', 'Köln']

In [158]:
df['stadt'] = stadt

In [159]:
df

          n         a         z         o      stadt
u -0.497104 -0.754070 -0.943406  0.484752     Berlin
x -0.116773  1.901755  0.238127  1.996652  Stuttgart
m -0.993263  0.196800 -1.136645  0.000366    München
i  1.025984 -0.156598 -0.031579  0.649826       Köln

In [162]:
df.set_index('stadt')

                  n         a         z         o
stadt
Berlin    -0.497104 -0.754070 -0.943406  0.484752
Stuttgart -0.116773  1.901755  0.238127  1.996652
München   -0.993263  0.196800 -1.136645  0.000366
Köln       1.025984 -0.156598 -0.031579  0.649826

In [163]:
# multindexing

#Classify the marks of two students in four subjects.

In [207]:
student_name = 'cookie cookie cookie cookie mini mini mini mini'.split()
subjects = 'physics maths CS stats physics maths CS stats'.split()
multi_index = list(zip(student_name,subjects))
multi_index = pd.MultiIndex.from_tuples(multi_index)
multi_index

MultiIndex([('cookie', 'physics'),
            ('cookie',   'maths'),
            ('cookie',      'CS'),
            ('cookie',   'stats'),
            (  'mini', 'physics'),
            (  'mini',   'maths'),
            (  'mini',      'CS'),
            (  'mini',   'stats')],
           )

In [254]:
frame = pd.DataFrame(100,index=multi_index,columns=['Total Marks'])

frame['Obtained Marks'] = np.random.randint(50, 98, frame.shape[0])
frame

                      Total Marks  Obtained Marks
Student Name Subject
cookie       physics          100              63
             maths            100              91
             CS               100              77
             stats            100              97
mini         physics          100              68
             maths            100              58
             CS               100              58
             stats            100              90

In [255]:
# give index names

In [256]:
frame.index.names = ['Student Name','Subject']
frame

                      Total Marks  Obtained Marks
Student Name Subject
cookie       physics          100              63
             maths            100              91
             CS               100              77
             stats            100              97
mini         physics          100              68
             maths            100              58
             CS               100              58
             stats            100              90

In [261]:
# find physics marks of mini
frame.loc['mini'].loc['physics']['Obtained Marks']

68

In [264]:
# or can also be written as

frame.xs(['mini','physics'])

Total Marks       100
Obtained Marks     68
Name: (mini, physics), dtype: int64

In [267]:
# find CS marks of both mini and cookie

In [268]:
frame.xs('CS',level='Subject')

              Total Marks  Obtained Marks
Student Name
cookie                100              77
mini                  100              58